{"keys":[{"path":["title"],"id":"title","weight":1,"src":"title"},{"path":["body"],"id":"body","weight":1,"src":"body"}],"records":[{"i":0,"$":{"0":{"v":"This page has not yet sprouted","n":0.408},"1":{"v":"[Dendron](https://dendron.so/) (the tool used to generate this site) lets authors selective publish content. You will see this page whenever you click on a link to an unpublished page\n\n![](https://foundation-prod-assetspublic53c57cce-8cpvgjldwysl.s3-us-west-2.amazonaws.com/assets/images/not-sprouted.png)","n":0.189}}},{"i":1,"$":{"0":{"v":"Root","n":1},"1":{"v":"# Welcome to Dendron\n\nThis is the root of your dendron vault. If you decide to publish your entire vault, this will be your landing page. You are free to customize any part of this page except the frontmatter on top.\n","n":0.158}}},{"i":2,"$":{"0":{"v":"Linux Install Party","n":0.577},"1":{"v":"\nBem vindo ao guia da Linux Install Party 2021!\n\nEste é um guia para servir de acompanhamento ao que vai acontecendo durante o evento.\n\n## Avisos\n> Embora seja bastante improvável, é possível que ocorra perda ou corrupção de dados. Recomendamos que tenham backups de ficheiros importantes antes de começar.\n\n### Programa\n - Conceitos fundamentais de Linux\n - Diferenças entre Linux e Windows\n - Particionamento do disco, pronto para single ou dualboot\n (TODO) adicionar aqueles previews estilo Dendron Wiki\n - Escolha da distro\n - Preparar a Pen USB, caso necessário\n - Instalar a distribuição\n - ?\n\n### Todo\n - [ ] Conceitos\n . [ ] Particionamento\n - [ ] Hierarquia de ficheiros, diferenças p/ windows\n - [ ] All distros\n - [ ] Gestão de software (centralized package manager vs going to random websites and downloading stuff)\n - [ ] \n\n### Escolha de distribuição\n\nCaso ainda não saibas que distribuição hás de escolher, podes consultar esta _decision tree_.\n![Decision Tree de Distros](https://cdn.discordapp.com/attachments/878358615117922345/915026433338908742/a696db6c-9ebd-44cc-b80b-9d4f1639c404.png)\n\n","n":0.08}}},{"i":3,"$":{"0":{"v":"ZorinOS","n":1},"1":{"v":"\n![](https://cdn.discordapp.com/attachments/878358615117922345/915022354369875969/zorinos.gif)\n\nZorin OS é uma distribuição derivada de Ubuntu, desenhada para novatos que queiram a experiência de Windows ou MacOS[^1].\n\nÉ uma ótima escolha para quem queira um sistema pronto a usar ou ainda não esteja muito à vontade com Linux.\n\n### Pros\n    ✅ Design polido e moderno, amigável a quem vem de Windows e MacOS[^1]\n    ✅ Loja com um grande catálogo de Software pronto a usar\n    ✅ Bom desempenho em computadores menos potentes (usando  versão _Lite_)\n    ✅ Notificações do telemóvel no computador com Zorin Connect\n    \n### Cons\n    ❌ Não há nenhuma maneira direta de atualizar para a próxima versão de ZorinOS (quando sair)\n    \n    \nÉ possível ver mais detalhes sobre ZorinOS [aqui](https://zorin.com/os/details/).\n\n[^1]: A aparência de MacOS apenas está disponível na versão Pro(paga) de ZorinOS.","n":0.091}}},{"i":4,"$":{"0":{"v":"Pop!_OS","n":1},"1":{"v":"\n![](https://cdn.discordapp.com/attachments/878358615117922345/914946319615930368/pop_os.gif)\n","n":1}}},{"i":5,"$":{"0":{"v":"Particionamento","n":1}}},{"i":6,"$":{"0":{"v":"Metodosdeinstalacao","n":1}}},{"i":7,"$":{"0":{"v":"Eduroam","n":1},"1":{"v":"\nA maneira mais fácil de usar a eduroam em Linux é através do NetworkManager. Já vem pré-instalado na maioria das distribuições \"Beginner-friendly.\"\n\n1. Download do certificado para a eduroam do IST [neste link](https://si.tecnico.ulisboa.pt/configuracoes/cacert.crt).\n> É importante não apagar ou mover este ficheiro mais tarde!\n\n2. Escolher a `eduroam` de entre as ligações disponíveis \n\n![](/assets/images/2021-11-30-18-09-26.png)\n\n3. Preencher os campos pedidos, conforme a imagem. \n\n![](/assets/images/2021-11-30-18-19-30.png) \n\n(É importante que o domínio seja `IST - eduroam` , com os devidos espaços.)\n\n\n\n## Referências\n- https://si.tecnico.ulisboa.pt/servicos/redes-e-conetividade/rede-sem-fios/","n":0.115}}},{"i":8,"$":{"0":{"v":"Conceitos","n":1},"1":{"v":"\nAqui estão alguns conceitos básicos sobre Linux, assim como algumas principais diferenças entre o funcionamento de Linux e Windows.\n\n## Estrutura de diretorias\n    \nEm Windows , finish me\n\n[^1]: NixOS, por exemplo, pode não seguir esta convenção.\n","n":0.169}}},{"i":9,"$":{"0":{"v":"Partições","n":1}}},{"i":10,"$":{"0":{"v":"Arch Linux","n":0.707},"1":{"v":"\n![](https://archlinux.org/static/logos/archlinux-logo-light-90dpi.d36c53534a2b.png)\n\nArch Linux é uma distribuição cuja imagem de instalação apenas fornece uma base mínima sobre a qual é possível configurar todo o sistema como o utilizador bem entender. \n\nArch Linux é diferente das outras distros por ser baseada num modelo de [rolling-release](https://en.wikipedia.org/wiki/Rolling_release). Isto significa que não existem versões, pelo que os pacotes que Arch fornece encontram-se sempre na última versão estável disponível.\n\nNão existe nenhum instalador oficial de Arch[^1], pelo que ao iniciar a imagem apenas nos encontramos com um terminal, com apenas os mínimos necessários para efetuar a instalação.\n\n### Instalação, resolução de problemas, outros\nA Arch Wiki fornece um guia extensivo de instalação que deve ser seguido paulatinamente. https://wiki.archlinux.org/title/Installation_guide\n\nPara além disto, a [Arch Wiki](https://wiki.archlinux.org/title/Frequently_asked_questions) tem posts bastante completos sobre tudo relacionado com Arch Linux (e frequentemente,também se aplicam a outras distribuições). É recomendado a quem pretenda usar Arch Linux regularmente que se habitue a explorar e a resolver problemas através da mesma, pois a maioria dos mesmos já se encontram lá descriminados.\n\n\n### Pros\n    ✅ Permite e encoraja uma customização profunda de todos os aspetos do sistema\n    ✅ Suportado por uma entidade independente\n    ✅ Software disponível sempre na última versão estável\n    ✅ É tão rápido quanto o utilizador queira\n\n### Cons\n    ❌ Não recomendado a quem não queira gastar bastante tempo a aprender e configurar o seu sisteam\n\n\n\n[^1]: Existe um novo instalador denominado de [archinstall](https://wiki.archlinux.org/title/Archinstall) , embora não seja recomendado aqui por ainda ser experimental e retirar um pouco do processo de aprendizagem que instalar Arch manualmente providencia.\n","n":0.064}}},{"i":11,"$":{"0":{"v":"Ajuda","n":1},"1":{"v":"\nEventualmente na tua jornada hás encontrar bugs, erros ou algum tema que ainda não percebes muito bem. Aqui encontras alguns recursos que poderás usar para procurar informação e auxílio.\n\n### Arch Wiki\nA [Arch Wiki](https://wiki.archlinux.org/) é um ótimo recurso a consultar, mesmo para quem não usa Arch Linux. Cobre bastante bem a maioria dos grandes tópicos.\n\n### ISTHub\nCaso tenhas alguma questão que não consigas resolver, ou precises de companhia a aventurar te por um rabbit hole obscuro, não hesites em pedir-nos ajuda no canal `#tech` do [ISTHub](https://isthub.pt).\n\n\n","n":0.109}}},{"i":12,"$":{"0":{"v":"After party","n":0.707},"1":{"v":"\n\nTens Linux instalado, funciona tudo bem, e agora?\n\nFicam aqui algumas ideias interessantes que podes fazer para aprofundar os teus conhecimentos:\n\n### Ricing\n> Ricing - Making improvements to a system that don’t actually do anyone any good, and can sometimes have negative ramifications\n\n\"Ricing\" é um termo que significa fazer melhorias puramente estéticas ao teu sistema.\n\nProvavelmente vais passar bastante tempo de volta do teu novo sistema operativo, portanto mais vale gastar algum tempo a torná lo mais cómodo e produtivo. Podes tirar algumas ideias do [r/unixporn](https://old.reddit.com/r/unixporn/).\n[Este post](https://thatnixguy.github.io/posts/ricing/) tem uma lista detalhada (mas não exaustiva) de diferentes tipos de ricing.\n\n### Window Managers\n\nTODO","n":0.101}}},{"i":13,"$":{"0":{"v":"README","n":1},"1":{"v":"# brain.rafael.ovh\nPublic Dendron vault with college notes and other random things\n","n":0.302}}}]}
